* Anotaciones
** Objetivos
*** tener la base de datos en la nube
*** tener mejores datos
** Ideas
*** orden de trabajo
primero lograr la base postegres funcionando en la maquina localmente,
pq ya sabemos que funciona en la nube (eso ya lo probamos el año
pasado). Aunque se podria reprobar en algun punto.
luego reescribir todos los programas con nuevos paradigmas.
*** nuevo paradigma de programacion
hacer una base que tenga un menu y una pantalla limpia con una barra
de busqueda arriba, tipo navegador. y de acuerdo a lo que necesitemos
despleguemos en la pantalla los datos en forma mas dinamica, quizas
usando como base canvas o edit o web y con los menus salgamos con
toplevels a hacer funciones extras. De paso puedo ir revisando todos
los programas actuales para ver lo que realmente se usa de lo que no
se usa, y lo que se usa hacerlo bien, o rehacerlo de otra forma o de
la misma forma pero mas simple quizas. 
*** paciencia con el trabajo
tener este log en el directorio nuevo, comenzar de nuevo, loggear
tiempo de trabajo y resumen de avance dia a dia, y llevar un registro
exacto de bugs y TODOs.
[2020-05-09 sáb] se trabaja muy  mucho a veces se toman caminos
equivocados en los cuales se pierde mucho tiempo, pero en el camino se
aprende mucho, nada se pierde creo, salvo la salud corporal en el
proceso continuo sin descanso. Pero creo que vamos a salir adelante.

* Agenda de trabajo
** [2020-05-06 mié]
*** desempolvado de la base postgres
:LOGBOOK:
CLOCK: [2020-05-06 mié 16:01]--[2020-05-06 mié 17:53] =>  1:52
:END:
postgres3 y 3-1
*** instalando herramientas para el manejo de postgres
:LOGBOOK:
CLOCK: [2020-05-06 mié 18:25]--[2020-05-06 mié 19:24] =>  0:59
:END:
pgadmin y adminer
30 minutos para instalar adminer por no seguir las instrucciones que
tenia en kubuntu.org, pero tenia las lineas cortadas. Consejo primero
ir a la pagina linkada.
pgadmin3 que viene con 2004 se instala en un minuto pero no sirve
doy por terminado con embole la busqueda de un reemplazo a pgadmin4
que aunque no era bueno era otra opcion para alguna que otra cualidad
que no tenia por ahi.
*** intentando resolver el problema de la funcion gc
:LOGBOOK:
CLOCK: [2020-05-06 mié 19:24]--[2020-05-06 mié 20:34] =>  1:10
:END:
resuelto, sacado los campos que estaban de mas, lo cual alivio la
consulta que paso de tres tablas a una sola. 
*** bonus final del dia
:LOGBOOK:
CLOCK: [2020-05-06 mié 21:00]--[2020-05-06 mié 21:59] =>  0:59
:END:
instale el puto Valentina que parece un muy muy buen sustituto del
pgadmin4.
encontre que los ipprovider con postgres incluido de argentina tienen
precios ridiculamente bajos. y no es solo uno sino que hay varios que
compiten entre si. o sea que hay que ver.
** [2020-05-07 jue]
*** procurando encryptacion de db
**** descubriendo TDE transparent data encryption postgres
:LOGBOOK:
CLOCK: [2020-05-07 jue 08:30]--[2020-05-07 jue 10:35] =>  2:05
:END:
intente instalar las dos versiones la 12 y la 9, y las dos fallaron en
el make install, con mensajes incomprensibles y cero respuesta en
google. Si bien es cierto que la "solucion" parece la mas acertada, no
parece muy conveniente el modo de acercarse. Seguire investigando.
*** llego a la conclusion de que debo hacer encryption side-client
dos horas perdidas lamentablemente las anteriores.
en el entretiempo lei los distintos enfoques de la encryptacion, y el
enfoque que mas me cuadra es el cliente-side o sea manejar la
encriptacion con tcl yo y mandar la tabla encryptada o con algunos
campos encriptados y listo y hacer el crypt/decrypt en la aplicacion.
[[https://marcopeg.com/2019/per-user-encryption-in-postgres][Blog donde se desarrolla el tema]]
CREATE EXTENSION IF NOT EXISTS pgcrypto;
To encrypt a plain string with a password you can use:

PGP_SYM_ENCRYPT('marco stuff', 'key')::text

To decrypt back to a plain string you can use:

PGP_SYM_DECRYPT(column_name::bytea, 'key')

-- Insert Encrypted
INSERT INTO users (name, data)
VALUES ('marco', PGP_SYM_ENCRYPT('marco stuff', 'key')::text);
-- Read and decrypt
SELECT
	name,
	PGP_SYM_DECRYPT(data::bytea, 'key') as data
FROM users WHERE name = 'marco';
**** encriptando tabla clientes
:LOGBOOK:
CLOCK: [2020-05-07 jue 14:00]--[2020-05-07 jue 14:55] =>  0:55
:END:
***** problemas presentados
****** columna dni cambiado de tipo 
alter table clientes
alter column dni set data type text;
sino no entra el texto codificado
****** se perdera la busqueda por dni
****** se pierde la relacion clientes/calle
*** OTRO ENFOQUE: COMENZAR DE NUEVO
remodelar en serio todo el sistema de tablas e ir haciendolo a medida
que vaya programando, para evitar campos heredados. Y ver como
impactan los problemas.
***** intentare instalar pgmodeler
:LOGBOOK:
CLOCK: [2020-05-07 jue 15:01]--[2020-05-07 jue 15:10] =>  0:09
:END:
sudo apt install pgmodeler
***** dividire la tabla clientes en dos cli_data cli_ex
:LOGBOOK:
CLOCK: [2020-05-07 jue 15:10]--[2020-05-07 jue 16:25] =>  1:15
:END:
y las relaciones con calles iran por id.
Terminado trabajosamente el primer modelo
cli_data/calles/barrios/zonas con los campos adecuados para recibir
los datos encriptados. No pude cargarlo automaticamente pero con 
psql rx -f schema.sql 
lo hago facilmente y rapido y me da info que yo puedo procesar.
***** carga de datos desde romitex.db a set cli_data
:LOGBOOK:
CLOCK: [2020-05-07 jue 17:40]--[2020-05-07 jue 18:45] =>  1:05
CLOCK: [2020-05-07 jue 16:35]--[2020-05-07 jue 17:13] =>  0:38

:END:
haciendo migra1.tcl y renegando con la primer subida.
Realizada la subida de la primera tanda pero sin tener las relaciones
sino no se puede.
Los FK no salen bien en pgmodeler, es mejor hacerlos en VStudio y que
los pasa bien y luego importar el modelo de nuevo en pgmodeler.
** [2020-05-08 vie]
*** CAMBIO RADICAL===> TO MYSQL
motiva el cambio el que estoy en el verdadero comienzo de todo y la
mayoria de los hosting tienen mysql y no quiero poner palos en la
rueda. Tambien no influye mucho el tema del wraper pq pienso que usar
el tdbc es mas seguro pq viene con el tcl core y es igual hacerlo en
postgres que en mysql, es mas queda abierto a usarlo con los dos.

*** INSTALACION
:LOGBOOK:
CLOCK: [2020-05-08 vie 09:30]--[2020-05-08 vie 10:26] =>  0:56
:END:
sudo apt install mysql-client
mysql -V
mysql -u USERNAME -p PASSWORD -h HOST-OR-SERVER-ip
sudo apt install mysql-server
sudo mysql_secure_installation
sudo emacs /etc/mysql/mysql.conf.d/mysqld.cnf
y cambiar bind-adderess line a 0.0.0.0 desde 127.0.0.1
y asi no podran contactar desde afuera a la base de datos local
sudo systemctl restart mysql
sudo systemctl enable mysql
verificar si esta recibiendo conecciones a 0.0.0.0
con 
ss -ltn
sudo ufw allow from any to any port 3306 proto tcp
[[https://linuxconfig.org/install-mysql-on-ubuntu-20-04-lts-linux][pagina donde se explica el proceso]]
**** creacion de la base de datos
sudo mysql; (como root)
CREATE DATABASE hero;
CREATE USER 'hero' IDENTIFIED BY 'ata';
GRANT ALL PRIVILEGES ON hero.* to hero;
FLUSH PRIVILEGES;
exit;

entro como
mysql -p
y pongo la password
*** reexplorando mytcl
:LOGBOOK:
CLOCK: [2020-05-08 vie 10:30]--[2020-05-08 vie 11:12] =>  0:42
:END:
**** instalando mysql-workbench
[[https://www.how2shout.com/how-to/how-to-install-mysql-workbench-on-ubuntu-20-04-lts.html][Procedimiento para instalar Workbench]]
trabajando con workbench. Creando el nuevo schema e intentando
vincularlo a la base de datos para ver si se puede hacer el camino
viceversa.
hecha la ingenieria forward para ir de diseño a base de datos como el
pgmodeler.
**** hacer el primer script para llenar la tablas con tcl
:LOGBOOK:
CLOCK: [2020-05-08 vie 13:52]--[2020-05-08 vie 14:53] =>  1:01
CLOCK: [2020-05-08 vie 12:08]--[2020-05-08 vie 13:24] =>  1:16
CLOCK: [2020-05-08 vie 11:15]--[2020-05-08 vie 11:46] =>  0:31
:END:
estoy trabado con el autoincrement por un lado y el local data loading
por otro.
***** ERROR: Error in startup script: ::mysql::exec/db server: Loading local data is disabled; this must be enabled on both the client and server sides
SHOW GLOBAL VARIABLES LIKE 'local_infile';
SET GLOBAL local_infile = 'ON'; -- esto como root
SHOW GLOBAL VARIABLES LIKE 'local_infile';
[[https://dba.stackexchange.com/questions/48751/enabling-load-data-local-infile-in-mysql][solucion]]
***** NO TIENE NADA QUE VER EL AUTOINCREMENT EN EL LOAD DATA
***** pude hacerlo manual con mysql -p --local-infile=1
***** MUY IMPORTANTE!!!! LINES TERMINATED BY '\r\n'
lo descubri por casualidad pq el manual decia que era para mac.
***** error en el LOAD DATA POR el local-infile
editar /etc/mysql/mysql.conf.d/mysqld.cnf
agregar al final
[client]  
local_infile=1
eso hace que a nivel server autorice el load-file
***** intento hacer los archivos csv con tcl EXCELENTE!!!!
perfecto!!!
falta ver ahora como funciona con las fk
funcionan bien pero volvi a tener calle,barrio y zona no vale la pena
caer en el tremendo dolor de bolas del id accessiano. Maxime cuando el
update cascade funciona bien
****** me hizo renegar que en la formacion del csv CUIDAR LOS ESPACIOS
no poner "", y las comas terminan el campo o bien el \r\n
p.e. $campo,$campo,$campo\r\n sin dejar espacios sino se traducen en
espacios en blanco en algunos campos no le hace nada pero en otros es
malo.
Y aparte un espacio en el ultimo campo CREA UN NUEVO REGISTRO NULL!!!
***** primer borrador del comando
:LOGBOOK:
CLOCK: [2020-05-08 vie 18:10]--[2020-05-08 vie 19:49] =>  1:39
CLOCK: [2020-05-08 vie 17:00]--[2020-05-08 vie 17:52] =>  0:52
:END:
la idea es un formato tipo browser que sea grande y que la informacion
fluya y que tambien se pueda maximizar sin problemas.
la idea es una barra de busqueda arriba y un gran edit abajo que
sirviera de base para desplegar informacion y un menu que sirviera de
base para todas las funciones.
primera parte terminada. el proyecto comenzo. ahora tengo que releer
bastante el tema text y/o canvas en su defecto.
** [2020-05-09 sáb]
**** encryptacion de columnas con AES
:LOGBOOK:
CLOCK: [2020-05-09 sáb 09:45]--[2020-05-09 sáb 10:38] =>  0:53
:END:
consegui las funciones encrypt/decrypt de AES y funcionan bien y es
simple el proceso pero no me anda en el simple proceso de CVS-INFILE
pq debe ser que dentro de la cadena encriptada hay comas y me altera
el CVS o sea que hay que buscar otra forma de encryptar.
o sea hacerlo una vez cargada la base en mysql localmente.
**** busqueda de encryptamiento por columna de mysql
:LOGBOOK:
CLOCK: [2020-05-09 sáb 10:38]--[2020-05-09 sáb 11:05] =>  0:27
:END:
doy por concluido momentaneamente el tema por un problema circular.
la columna que contenga el resultado de un AES_ENCRYPT tiene que ser
blob pero si la hago blob el contenido del campo se muestra mal y se
va a encriptar mal. 
Vamos a debilitar el proceso por buscar un tipo de encriptamiento que
no se puede hacer.
**** install phpmyadmin
:LOGBOOK:
CLOCK: [2020-05-09 sáb 12:37]--[2020-05-09 sáb 12:46] =>  0:09
:END:
[[https://www.digitalocean.com/community/tutorials/how-to-install-and-secure-phpmyadmin-on-ubuntu-20-04][pagina que explica]]
**** cambiar text por canvas
:LOGBOOK:
CLOCK: [2020-05-09 sáb 12:46]--[2020-05-09 sáb 13:09] =>  0:23
:END:
**** intentando abrir cuenta gcloud nuevamente
:LOGBOOK:
CLOCK: [2020-05-09 sáb 14:19]--[2020-05-09 sáb 14:32] =>  0:13
:END:
negativo
**** canvas tag
:LOGBOOK:
CLOCK: [2020-05-09 sáb 14:30]--[2020-05-09 sáb 15:23] =>  0:53
:END:
***** que es un tag
es la segunda forma de identificar un objeto. Una es el id que retorna
el create que lo capturamos con una variable y el otro es el o los
tags que le asignamos en -tags.
luego podemos manejarlo a traves de tags.
p.e.
.c delete title ;# borra los elementos que contengan el tag title si
no hay ninguno no da error.
.c itemconfigure title -font {} -fill color etc. ;# le asigna colorido
al tag. el -anchor w es importante en los textos para que se acomoden
bien.
-font {}
-fill color
-anchor w

tambien se pueden hacer bindings.
***** rearmado de tabla clientes
:LOGBOOK:
CLOCK: [2020-05-09 sáb 18:42]--[2020-05-09 sáb 20:50] =>  2:08
CLOCK: [2020-05-09 sáb 16:00]--[2020-05-09 sáb 18:26] =>  2:26
:END:
problemas
****** problemas con los id
si dejo el autonumerico me pone cualquiera lo que me llevaria a
prescindir del idcliente, y cambiar todo con el dni, pero que hago con
el idventas.puedo poner otro campo que contenga el idcliente o el
idventas que no sea el que tenia antes.
****** problemas con la cantidad de registros leidos 36902 vs 39673
al sacarle la coma a la calle quedaban fuera de fk varios registros
entre ellos 52.
y en gran parte solucione casi 3000 registros con hacer el csv con
package require csv
::csv::join [list $l $a $n $f]\r\n
parece que el csv sale mucho mejor parseado y anda feroz
todavia me queda una diferencia de 8 registros que no resuelvo, pq no
encuentro fk de barrios pero habia de ahi tambien

****** problema que agrega una fila NULL SOLVED
creo que es el puts newline del puts file
arreglado con el puts -nonewline
** [2020-05-10 dom]
*** evaluar el hacer script llano de subida 
:LOGBOOK:
CLOCK: [2020-05-10 dom 09:58]--[2020-05-10 dom 13:17] =>  3:19
:END:
termino la tabla clientes completa primero
DOY POR TERMINADO EL DESARROLLO en mysql pq no es factible hacer el
paso de los datos.
*** reinicio con postgres 
:LOGBOOK:
CLOCK: [2020-05-10 dom 14:04]--[2020-05-10 dom 15:37] =>  1:33
:END:
muy conforme con Adminer, por su rapidez y muy conforme con pgmodeler
tambien por su rapidez y por su interaccion a traves de Diff y con
postgres por su rapidez.
*** veo si puedo poner a full adminer
:LOGBOOK:
CLOCK: [2020-05-10 dom 15:56]--[2020-05-10 dom 16:34] =>  0:38
:END:
negativo - suficiente tiempo perdido. Sin documentacion.
*** hacer la tabla ventas
:LOGBOOK:
CLOCK: [2020-05-10 dom 16:35]--[2020-05-10 dom 17:35] =>  1:00
:END:
*** hacer la tabla pagos
:LOGBOOK:
CLOCK: [2020-05-10 dom 17:47]--[2020-05-10 dom 18:06] =>  0:19
:END:
*** hacer la tabla detalle de venta
:LOGBOOK:
CLOCK: [2020-05-10 dom 18:07]--[2020-05-10 dom 18:16] =>  0:09
:END:
** [2020-05-11 lun]
*** instalar laravel on ubuntu 20.04
:LOGBOOK:
CLOCK: [2020-05-11 lun 09:32]--[2020-05-11 lun 09:50] =>  0:18
:END:
use el camino sencillo via Composer
[[https://www.osradar.com/install-laravel-ubuntu-2004/][ver pagina donde explica el proceso]]
*** ESTUDIO VIDEO 8
:LOGBOOK:
CLOCK: [2020-05-11 lun 09:55]--[2020-05-11 lun 10:27] =>  0:32
:END:
*** ESTUDIO VIDEO 9
:LOGBOOK:
CLOCK: [2020-05-11 lun 10:35]--[2020-05-11 lun 10:50] =>  0:15
:END:
*** ESTUDIO VIDEO 10
:LOGBOOK:
CLOCK: [2020-05-11 lun 17:27]--[2020-05-11 lun 18:16] =>  0:49
CLOCK: [2020-05-11 lun 10:52]--[2020-05-11 lun 10:57] =>  0:05
:END:
*** hago tabla articulos,artcomprado,caja,ctas
:LOGBOOK:
CLOCK: [2020-05-11 lun 16:50]--[2020-05-11 lun 17:27] =>  0:37
:END:
*** ESTUDIO VIDEO 11
:LOGBOOK:
CLOCK: [2020-05-11 lun 18:16]--[2020-05-11 lun 18:32] =>  0:16
:END:
*** ESTUDIO VIDEO 2-3-4
:LOGBOOK:
CLOCK: [2020-05-11 lun 18:33]--[2020-05-11 lun 19:11] =>  0:38
:END:
*** ESTUDIO VIDEO 12
:LOGBOOK:
CLOCK: [2020-05-11 lun 19:15]--[2020-05-11 lun 19:53] =>  0:38
:END:
*** boludeando con la increible falta de integracion git de sublime
:LOGBOOK:
CLOCK: [2020-05-11 lun 19:50]--[2020-05-11 lun 20:49] =>  0:59
:END:
** [2020-05-12 mar]
*** ESTUDIO VIDEO 13-14-15
:LOGBOOK:
CLOCK: [2020-05-12 mar 09:25]--[2020-05-12 mar 10:52] =>  1:27
:END:
*** estudio video 16-17
:LOGBOOK:
CLOCK: [2020-05-12 mar 14:47]--[2020-05-12 mar 15:39] =>  0:52
CLOCK: [2020-05-12 mar 14:08]--[2020-05-12 mar 14:30] =>  0:22
:END:
*** estudio video 20 -21 -22 (salteo 18-19)
:LOGBOOK:
CLOCK: [2020-05-12 mar 16:57]--[2020-05-12 mar 18:47] =>  1:50
:END:
*** estudio video 23 y 25 (el 24 no esta)
:LOGBOOK:
CLOCK: [2020-05-12 mar 18:56]--[2020-05-12 mar 20:10] =>  1:14
:END:
** [2020-05-13 mié]
*** estudio video 26-27 y 28 parcial
:LOGBOOK:
CLOCK: [2020-05-13 mié 18:09]--[2020-05-13 mié 18:24] =>  0:15
CLOCK: [2020-05-13 mié 10:01]--[2020-05-13 mié 11:16] =>  1:15
:END:
*** comienzo el proyecto Romi
:LOGBOOK:
CLOCK: [2020-05-13 mié 21:40]--[2020-05-13 mié 21:53] =>  0:13
CLOCK: [2020-05-13 mié 19:28]--[2020-05-13 mié 21:06] =>  1:38
CLOCK: [2020-05-13 mié 16:05]--[2020-05-13 mié 17:50] =>  1:45
:END:
cree el proyecto
cree el model para clientes
cree la migracion
cree la tabla
migre
genere el controlador
hice una view index funcional paginada con una table en html
me trabe en una view show o edit que levante un solo registro a
discrecion y lo muestre en un formulario basico que ya esta hecho.
subi el proyecto a github.
** [2020-05-14 jue]
*** prosigo con el proyecto romi
:LOGBOOK:
CLOCK: [2020-05-14 jue 19:10]--[2020-05-14 jue 20:48] =>  1:38
CLOCK: [2020-05-14 jue 17:15]--[2020-05-14 jue 18:51] =>  1:36
CLOCK: [2020-05-14 jue 15:05]--[2020-05-14 jue 16:55] =>  1:50
CLOCK: [2020-05-14 jue 11:12]--[2020-05-14 jue 12:35] =>  1:23
CLOCK: [2020-05-14 jue 10:19]--[2020-05-14 jue 11:08] =>  0:49
:END:
creado layout con el uso de @extends @section @endsection @yield y el
form create todo en 45min. lo unico que no tomo bootstrap pero ya
llegara.
por grandes demoras en delete dentro de postgres hice una tabla
clientes de prueba de 5000 registros desde tcl-migra para las pruebas
que se dumpea instantanea y logre la insercion de registros via
create, solo tengo que resolver el tema del id pq esta usando id bajos
no sigue con los id arriba. (quizas sea un tema para resolver despues
y no trabarse ahora.) Resuelto (ver en troubleshoting) por mis medios.
Avanzo en las otras vistas.
en el tercer tiempo logre:
vistas index con botones edit y delete, vista edit, vista create,
funcionalidad para editar y para borrar, y mejoro filtro con el uso de
DB.
En el cuarto tiempo logre descubrir el error con bootstrap y era un
error de tipeo habia puesto ccs en vez de css.
anda hermoso
ahora fracaso en intentar subir los datos a heroku una bosta, y abro
una cuenta en google cloud. ya abri la cuenta de google cree una db un
usuario subi los datos y nada mas que eso. ahora tendria que ver como
subo la aplicacion tipo heroku y la sirvo desde arriba.
doy por terminado pq tambien instale luego de un primer intento
fallido semantic iu y lo hice funcionar al menos para un widget lo
cual va a requerir muchisimo trabajo de investigacion y puesta a punto
para definir lo que va quedando bien.
** [2020-05-15 vie]
*** prosigo con el proyecto
:LOGBOOK:
CLOCK: [2020-05-15 vie 20:20]--[2020-05-15 vie 20:32] =>  0:12
CLOCK: [2020-05-15 vie 18:23]--[2020-05-15 vie 19:54] =>  1:31
CLOCK: [2020-05-15 vie 16:55]--[2020-05-15 vie 18:23] =>  1:28
CLOCK: [2020-05-15 vie 15:16]--[2020-05-15 vie 16:30] =>  1:14
CLOCK: [2020-05-15 vie 14:20]--[2020-05-15 vie 15:10] =>  0:50
CLOCK: [2020-05-15 vie 13:05]--[2020-05-15 vie 13:37] =>  0:32
CLOCK: [2020-05-15 vie 09:50]--[2020-05-15 vie 11:45] =>  1:55
:END:
aplicando semantic al proyecto.
de acuerdo a las lecturas de esta mañana me decante por semantic en
desmedro de boostrap
ya hice las vistas create y edit con form nuevos que usan varios
campos por fila.
Terminado y avanzado bastante con semantic ui, bastante facil de
implementar, salvo en la parte script de validacion de form que no la
hice funcionar. Se que los script de js se ponen entre las tags script
pero no funcionan.
Creo que el paso siguiente es seguir con la creacion del modelo de
tablas o sea adquirir mas conocimiento en el manejo de eloquent para
lograr tener la bd postgres igual que la generada y poder traspasar
Los datos correctamente para comenzar a trabajar. - pausa
hice los migrate de tres tablas con sus relaciones, vamos barbaro,
seguire con las tablas a ver como vamos. 
OJO CON LOS ERRORES LA MAYORIA SON ERRORES DE TIPEADO. PERO PIERDO
TIEMPO BUSCANDO EN INTERNET Y NO OBTENGO RESULTADO Y ES PQ EL ERROR ES
MIO.
paso con nullable esta vez pero ha pasado con otras cosas, lo que pasa
que como no sabemos el funcionamiento exacto del programa asumimos que
cualqueir error se debe a algo que no funciona.
Hice la tabla ventas. me animo ahora a hacer la tabla pagos ya que
estoy.
hice todas las tablas que tengo hasta ahora y tambien hice el proyecto
nuevo en github, faltaria hacer los datos en tcl completos para
trabajar ya con toda esa parte.
termine de pasar todo. ahora comienzo un proyecto basico de consulta
de saldo de cliente.
termino funcionando el primer script de js pero falta ahora linkearlo
con los datos en la misma pantalla.
falta menos.
falta teoria.
** [2020-05-16 sáb]
:LOGBOOK:
CLOCK: [2020-05-16 sáb 16:47]--[2020-05-16 sáb 20:43] =>  3:56
CLOCK: [2020-05-16 sáb 10:30]--[2020-05-16 sáb 12:46] =>  2:16
:END:
primer round hice el datatable.
segundo round intentare subir al gcloud. fallido pq no admite mas que
10000 files y aunque parezca mentira el directorio rom/ tiene 27600
pero gcloud acusaba 12400 como invalido y averigue otra forma que
tambien era inviable por lo complicada.
intente en heroku, bastante bien la subida pq se hace en diez segundos
por git, pero no puedo conectar con la base de datos, a pesar de que
si pude subir los datos mediante psql a pesar de los nombres largos de
db host y usuario.
** [2020-05-17 dom]
:LOGBOOK:
CLOCK: [2020-05-17 dom 08:39]--[2020-05-17 dom 11:05] =>  2:26
:END:
terminado el objetivo de la semana con la puesta en marcha de la
pagina en la web con heroku.
casi todas las trabas no fueron tales. creia que no andaba la base de
datos y quizas andaba de un principio y era que no se mostraban los
contenidos inseguros a nivel navegador, no tenia nada que ver heroku y
era tan simple como poner en la barra del navegador http en vez de
https. y luego perdi un monton de tiempo pq un bug o no se que de
firefox que me saca de la pagina cuando esta en claro, me hizo pensar
que solo se puede acceder de la ip propia y entonces perdi tiempo
rastreando ese error, y no era tal los otros navegadores no presentan
el error y se puede usar desde claro tambien.
el comun denominador de que un error no existe es que no hay preguntas
para el. puede o no haber respuesta o alguno que diga que no tiene
solucion, pero cuando no hay preguntas es pq estamos ante un
falso-error.
por la presuncion de que algo no anda por desconocimiento.
** [2020-05-18 lun]
:LOGBOOK:
CLOCK: [2020-05-18 lun 18:04]--[2020-05-18 lun 20:13] =>  2:09
CLOCK: [2020-05-18 lun 17:39]--[2020-05-18 lun 17:50] =>  0:11
CLOCK: [2020-05-18 lun 14:21]--[2020-05-18 lun 17:36] =>  3:15
CLOCK: [2020-05-18 lun 13:29]--[2020-05-18 lun 14:07] =>  0:38
CLOCK: [2020-05-18 lun 12:03]--[2020-05-18 lun 13:25] =>  1:22
CLOCK: [2020-05-18 lun 11:09]--[2020-05-18 lun 11:24] =>  0:15
CLOCK: [2020-05-18 lun 09:33]--[2020-05-18 lun 10:57] =>  1:24
:END:
el plan de trabajo para la semana seria primero terminar de maquetar
la base de datos o sea recorrer toda la bd de sqlite y ver que tablas
van a pasar a postgres y hacer el model. Ahi vamos a saltear un paso y
hacerlo directo con laravel y luego de ultima lo leemos con pgmodeler
para tenerlo visualmente armado.
Termine de hacer todas las tablas con migrate. Ahora paso a pgtcl para
el script migra.
me trabe un monton con la tabla detvta y la relacion con articulos que
tenia un monton de falla pq tenia como cien registros huerfanos.
Opte por no llenarme de datos vanos o sea tablas de registro como
recorridos listados lotesrbos que solo saco las de este año.
termine de subir los datos a heroku y puse en marcha de nuevo la
aplicacion.
por un lado no pude inicializar el script de creacion de tablas no me
dejaba entrar con -f. lo tuve que hacer a mano y me avive tarde que
podia cortar y pegar por trozos grandes. Evite la propiedad de las
tablas pq eso generara conflicto pienso pq no tengo creado un role
dentro.
y por otro lado no tuve que renegar con el tema de la asignacion de la
base de datos a la aplicacion pq lo hizo solo. como dice la
documentacion hacer el addon le asigna el database_url a la app, y en
el log de la app veo atach database y setting database_url y eso lo
hizo solo, no tuve que hacer nada yo. y fui probando la aplicacion y
daba errores compatibles con los status del momento sin existir db,
sin existir la tabla y sin existir los datos y luego largo.
** [2020-05-19 mar]
:LOGBOOK:
CLOCK: [2020-05-19 mar 17:24]--[2020-05-19 mar 18:07] =>  0:43
CLOCK: [2020-05-19 mar 14:16]--[2020-05-19 mar 17:02] =>  2:46
CLOCK: [2020-05-19 mar 12:37]--[2020-05-19 mar 13:50] =>  1:13
CLOCK: [2020-05-19 mar 12:06]--[2020-05-19 mar 12:36] =>  0:30
CLOCK: [2020-05-19 mar 10:20]--[2020-05-19 mar 11:15] =>  0:55
:END:
primero arreglo problema con tabla pagos que dio un error al cargar a
heroku
me llevo bastante tiempo pero la tabla quedo depurada, me llevo una
hora y media, dos sesiones.
Ahora empiezo a reentrenarme con videos objetivo ponerle auth y
midleware a la aplicacion y hacer un route group.
ya tengo auth, tengo midleware, y estoy probando plantillas de diseño,
aunque la basica que viene con laravel no me disgusta pero las hay mas
profe.
interesante el avance de hoy, pq veo que tendria un esqueleto para
desarrollar en paginas individuales que luego se pondrian u
organizarian en una plantilla adecuada y se regularia por permisos. 
Tambien falta aprender mucho mas de DB y descubri el tinker que es
como una consola que permite probar el eloquent.
** [2020-05-20 mié]
:LOGBOOK:
CLOCK: [2020-05-20 mié 18:33]--[2020-05-20 mié 21:31] =>  2:58
CLOCK: [2020-05-20 mié 16:53]--[2020-05-20 mié 18:19] =>  1:26
CLOCK: [2020-05-20 mié 14:06]--[2020-05-20 mié 14:30] =>  0:24
CLOCK: [2020-05-20 mié 13:35]--[2020-05-20 mié 13:40] =>  0:05
CLOCK: [2020-05-20 mié 12:36]--[2020-05-20 mié 13:17] =>  0:41
CLOCK: [2020-05-20 mié 12:17]--[2020-05-20 mié 12:36] =>  0:19
CLOCK: [2020-05-20 mié 10:30]--[2020-05-20 mié 11:29] =>  0:59
:END:
la idea es comenzar con la pagina de carga de ventas, la cual sera
lenta pq necesito aprender mucho, es mas anoche lei tres horas, esta
mañana dos.
Lei mucho bootstrap, descarte un formbuilder pq era muy complejo, deje
para mas adelante el midleware para cuando tenga mas paginas y ahora
estoy a pleno con datetables que creo que sera una parte esencial de
mis forms.
** [2020-05-21 jue]
:LOGBOOK:
CLOCK: [2020-05-21 jue 10:00]
:END:
luego de haber reestudiado la posibilidad de volver a semantic-ui me
decante definitivamente por boostrap pq semantic es un proyecto
muerto.
a bs hay que aprenderlo.


* doc
** dump/ restore schema
pg_dump > file
psql hero < schema.sql
** corriendo postgres3 / postgres3-1 / postgres 5
OJO que correrlos dentro de Visual-Code es un desastre, usa cerca del
50% del CPU y la maquina parece tomar vuelo y es muy lento.
La lentitud se debe a que operan los triggers a full. 
*** Problema de la lentitud por causa de los triguers SOLVED
SET session_replication_role = replica;
SET session_replication_role = DEFAULT;
Estos dos comandos al comienzo y al final desactivan y vuelven a
activar los triggers en forma global. Se supone que la db esta bien
conformada pq la estoy pasando desde sqlite. la velocidad es x10 y el
uso del CPU baja al 5%. Siendo un proceso que debo repetir a menudo
esta bien que encuentre una solucion.
[[http://koo.fi/blog/2013/01/08/disable-postgresql-triggers-temporarily/][Pagina que explica el tema]]
** psql
importantisimo aprender psql por la falta de otras herramientas
*** ver/editar una funcion
\ef <function name> 
luego te da a elegir el editor de texto 
aunque no guarda la edicion si la puedo salvar y correr via
psql<edicion.sql

*** ver detalles de una tabla
\d
*** ver tablas en la db
\dt \dt+ \dtS
*** cargar un script
psql db -f script
** sqlite
*** encontrar registros huerfanos
SELECT count(*)
FROM payment AS child
WHERE rental_id IS NOT NULL
  AND NOT EXISTS (
  SELECT NULL FROM rental AS parent WHERE parent.rental_id = child.rental_id
);
** pgmodeler 
*** agregado de tabla
**** no olvidar primero la sequencia
crear un objeto sequencia con nombre tbl_id_seq y todo normal solo con
propiedad hero
**** hacer la tabla
solo con propiedad hero
se pueden poner los campos ahi mismo
se pone sequence y se elige la sequence de public. y tambien se lo
pone como primary key al id.
**** agregar los otros campos
**** agregar una constraint fk a la tabla
NEW constrain 
constrain type - Foreign 
Columns elegir la columna y bajarla
referenced column elegir la tabla y columna y bajarla y alli los
cascade
**** guardar y validar a menudo
*** Hacer Diff
Current model
Compare to conection elegir - DAtabase elegir
use postgres 12 marcar y Apply on server marcar.
Se puede guardar ese Preset para facilidad.
Esto exporta a la base todos los cambios.
** Adminer
*** conexion localhost/adminer.php
*** refresco usualmente cambiando la db pq no veo boton de refresco
*** Select Data - Show structure 
son los dos lugares mas importantes.
** gcloud
aparte de seguir los pasos de la guia laravel/gcloud que esta en
google, lo que no esta/no funciona es lo siguiente
*** hay que instalar el gcloud en la maquina local con sudo snap install google-cloud-sdk --classic
*** hay que hacer un gcloud init
*** el archivo app.yaml va en /rom o sea en el raiz de laravel
*** no sirve el comando sed para hacerlo automatico lo hice a mano
** boostrap 
composer require laravel/ui
php artisan ui boostrap
npm install && npm run dev
*** segun aprendible video 36
yarn remove bootstrap (para lo cual antes capaz hacer yarn install)
yarn add bootstrap --dev (luego se ve en package json como cambia la
version)
yarn watch (si queremos ver los cambios al instante mientras
programamos ver los videos de aprendible los ultimos)
** instalar SEMANTIC UI
**** npm install semantic-ui-css --save-dev
no usar lo que dice el manual de semantic
**** hacer los hints que te de npm
**** corregir el webpack.mix.js segun la pagina del link
[[https://laracasts.com/discuss/channels/elixir/semantic-ui-integration][link que explica]]
mix.js('resources/js/app.js', 'public/js')
    .sass('resources/sass/app.scss', 'public/css')
    .copy('node_modules/semantic-ui-css/semantic.min.css','public/css/semantic.min.css')
    .copy('node_modules/semantic-ui-css/semantic.min.js','public/js/semantic.min.js');
**** npm run dev
te da cuando termina un icono rectangular arriba a la derecha de
laravel
** GUIA DE ACCION CON LARAVEL
*** crear el proyecto con laravel new rom
*** crear el model para la tabla
php artisan make:model Cliente
*** crear la migracion para la tabla
php artisan make:migration  create_table_clientes --create=clientes
*** unir los dos pasos anteriores con php artisan make:model Cliente -m
en vez de hacer los pasos por separado hacemos un solo paso y
listo. asi hice todas las tablas
*** hacemos el detalle de la tabla o sea los campos en el file 202005...
segun los tipos de campo $table->string('dni',8);
*** migramos
php artisan migrate
*** si hay que migrar de nuevo
php artisan migrate fresh o refresh ojo que borra todos los datos
*** generamos el controlador para la tabla
php artisan make:controller ClienteController -r (resourse crea las 7
rutas)
que podemos ver con php artisan r:l
*** usar la clase dentro del controlador
use App\Cliente;
$clientes = Cliente::get();
*** para controlar que campos van a ser guardados
en cliente.php
protected $fillable = ['dni','nombre']
** git cambiar repositorio remoto
git remote -v muestra el repositorio actual que responde el git
git remote set-url origin https://github.com/... se pone el nuevo
para cambiar el de heroku en caso de hayamos cambiado la app
git remote set-url heroku https://heroku.com....

* troubleshoting
** laravel
*** no existe laravel como comando para ejecutar laravel new
aunque esta instalado
ejecutar
composer global require "laravel/installer"
y luego agregar a .bashrc
export PATH=$HOME/.config/composer/vendor/bin:$PATH
y hacer
source .bashrc
y listo
*** dump solo datos y por tablas
pg_dump -t clientes -a rx >dumpclientes.sql
restore con
psql romi -f dumpclientes.sql
*** paginate() solo funciona con query no con collection
    
    Cliente::all() => Returns a Collection

    Cliente::all()->where() => Returns a Collection

    Cliente::where() => Returns a Query

    Cliente::where()->get() => Returns a Collection

    Cliente::where()->get()->where() => Returns a Collection

You can only invoke "paginate" on a Query, not on a Collection.

And yes, it is totally confusing to have a where function for both
Queries and Collections, working as close as they do, but it is what
it is.
*** id create empieza de cero
no se puede agregar un registro indicando id, pq es autonumerico. y
comienza de cero, dando el clasico error id duplicada.
hay soluciones en internet que no andan.
aplico mi antigua solucion luego de hacer el restore updateo todos los
seq con el comando adecuado

select setval('clientes_id_seq',(select max(id) from clientes));
incluso podria hacerlo o bien manualmente pq es una unica vez o bien
ir haciendo un script con tcl.
